In [176]:
import pandas as pd

co2Link='https://github.com/IntroSpatialDataScience/ClimateChangeData/raw/main/data/CO2_emission.csv'
precipitationLink = 'https://github.com/IntroSpatialDataScience/ClimateChangeData/raw/main/data/precipitation_mean.csv'
solarElectricityLink = 'https://github.com/IntroSpatialDataScience/ClimateChangeData/raw/main/data/solar_electricity.csv'
co2=pd.read_csv(co2Link)
precipitation=pd.read_csv(precipitationLink)
solar = pd.read_csv(solarElectricityLink)

In [177]:
co2_new=co2.copy()
precipitation_new=precipitation.copy()
solar_new=solar.copy()

In [178]:
co2_new.rename(columns={'Country or Area':'Country'}, inplace=True)
precipitation_new.rename(columns={'Country or Territory':'Country'}, inplace=True)
solar_new.rename(columns={'Country or Area':'Country'}, inplace=True)

In [179]:
precipitation_new['Country']=precipitation_new.Country.str.title()

In [180]:
precipitation_new.head()

,Country,Station Name,Period,Statistic Description,Unit,Jan,Jan Footnotes,Feb,Feb Footnotes,Mar,...,Oct,Oct Footnotes,Nov,Nov Footnotes,Dec,Dec Footnotes,Annual,Annual Footnotes,Annual NCDC Computed Value,Annual NCDC Computed Value Footnotes
0,"Afghanistan, Islamic State Of",Faiz abad,1961-1983,Mean Monthly Value,mm,49.4,NaN,65.0,NaN,91.9,...,23.4,NaN,29.7,NaN,34.1,NaN,40.4,NaN,484.9,NaN
1,"Afghanistan, Islamic State Of",Sheberghan,1959-1983,Mean Monthly Value,mm,42.3,NaN,44.3,NaN,56.4,...,6.6,NaN,13.6,NaN,29.8,NaN,19.2,NaN,230.5,NaN
2,"Afghanistan, Islamic State Of",Mazar-i-Sharif,1958-1983,Mean Monthly Value,mm,28.9,NaN,34.8,NaN,43.8,...,3.9,NaN,13.5,NaN,21.7,NaN,15.5,NaN,186.4,NaN
3,"Afghanistan, Islamic State Of",Kunduz,1968-1983,Mean Monthly Value,mm,44.0,NaN,56.5,NaN,76.7,...,7.3,NaN,23.7,NaN,28.4,NaN,26.8,NaN,322.6,NaN
4,"Afghanistan, Islamic State Of",Maimana,1964-1983,Mean Monthly Value,mm,49.9,NaN,60.5,NaN,82.2,...,9.6,NaN,20.9,NaN,44.7,NaN,29.6,NaN,355.6,NaN

In [181]:
precipitation_new['Country']=precipitation_new.Country.str.split(',',expand=True)[0]

In [182]:
precipitation_new.head()

,Country,Station Name,Period,Statistic Description,Unit,Jan,Jan Footnotes,Feb,Feb Footnotes,Mar,...,Oct,Oct Footnotes,Nov,Nov Footnotes,Dec,Dec Footnotes,Annual,Annual Footnotes,Annual NCDC Computed Value,Annual NCDC Computed Value Footnotes
0,Afghanistan,Faiz abad,1961-1983,Mean Monthly Value,mm,49.4,NaN,65.0,NaN,91.9,...,23.4,NaN,29.7,NaN,34.1,NaN,40.4,NaN,484.9,NaN
1,Afghanistan,Sheberghan,1959-1983,Mean Monthly Value,mm,42.3,NaN,44.3,NaN,56.4,...,6.6,NaN,13.6,NaN,29.8,NaN,19.2,NaN,230.5,NaN
2,Afghanistan,Mazar-i-Sharif,1958-1983,Mean Monthly Value,mm,28.9,NaN,34.8,NaN,43.8,...,3.9,NaN,13.5,NaN,21.7,NaN,15.5,NaN,186.4,NaN
3,Afghanistan,Kunduz,1968-1983,Mean Monthly Value,mm,44.0,NaN,56.5,NaN,76.7,...,7.3,NaN,23.7,NaN,28.4,NaN,26.8,NaN,322.6,NaN
4,Afghanistan,Maimana,1964-1983,Mean Monthly Value,mm,49.9,NaN,60.5,NaN,82.2,...,9.6,NaN,20.9,NaN,44.7,NaN,29.6,NaN,355.6,NaN

In [183]:
co2_new.shape,precipitation_new.shape,solar_new.shape

((129, 3), (4263, 33), (244, 6))

In [184]:
co2_new.columns,precipitation_new.columns,solar_new.columns

(Index(['Country', 'Year', 'Value'], dtype='object'),
 Index(['Country', 'Station Name', 'Period', 'Statistic Description', 'Unit',
        'Jan', 'Jan Footnotes', 'Feb', 'Feb Footnotes', 'Mar', 'Mar Footnotes',
        'Apr', 'Apr Footnotes', 'May', 'May Footnotes', 'Jun', 'Jun Footnotes',
        'Jul', 'Jul Footnotes', 'Aug', 'Aug Footnotes', 'Sep', 'Sep Footnotes',
        'Oct', 'Oct Footnotes', 'Nov', 'Nov Footnotes', 'Dec', 'Dec Footnotes',
        'Annual', 'Annual Footnotes', 'Annual NCDC Computed Value',
        'Annual NCDC Computed Value Footnotes'],
       dtype='object'),
 Index(['Country', 'Commodity - Transaction', 'Year', 'Unit', 'Quantity',
        'Quantity Footnotes'],
       dtype='object'))

In [185]:
co2_solar = co2_new.merge(solar_new,how='inner',left_on='Country',right_on='Country')
co2_solar

,Country,Year_x,Value,Commodity - Transaction,Year_y,Unit,Quantity,Quantity Footnotes
0,Australia,2020,400333.466600,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN
1,Australia,2020,400333.466600,Electricity - total solar production,2000.0,"Kilowatt-hours, million",38.000,NaN
2,Australia,2000,349635.486902,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN
3,Australia,2000,349635.486902,Electricity - total solar production,2000.0,"Kilowatt-hours, million",38.000,NaN
4,Australia,1990,278154.156296,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN
...,...,...,...,...,...,...,...,...
175,United Kingdom,2020,326920.692502,Electricity - total solar production,2000.0,"Kilowatt-hours, million",1.000,NaN
176,United Kingdom,2000,569744.209114,Electricity - total solar production,2020.0,"Kilowatt-hours, million",13157.994,NaN
177,United Kingdom,2000,569744.209114,Electricity - total solar production,2000.0,"Kilowatt-hours, million",1.000,NaN
178,United Kingdom,1990,602652.078446,Electricity - total solar production,2020.0,"Kilowatt-hours, million",13157.994,NaN
179,United Kingdom,1990,602652.078446,Electricity - total solar production,2000.0,"Kilowatt-hours, million",1.000,NaN

In [186]:
co2_solar_prep = co2_solar.merge(precipitation_new,how='inner',left_on='Country',right_on='Country')
co2_solar_prep

,Country,Year_x,Value,Commodity - Transaction,Year_y,Unit_x,Quantity,Quantity Footnotes,Station Name,Period,...,Oct,Oct Footnotes,Nov,Nov Footnotes,Dec,Dec Footnotes,Annual,Annual Footnotes,Annual NCDC Computed Value,Annual NCDC Computed Value Footnotes
0,Australia,2020,400333.466600,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN,ALBANY (ALBANY TOWN),1961-1965,...,96.0,NaN,37.9,NaN,23.0,NaN,-9999.9,1.0,1012.3,NaN
1,Australia,2020,400333.466600,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN,ESPERANCE (ESPERANCE POST OFFICE),1961-1969,...,51.3,NaN,19.3,NaN,17.9,NaN,-9999.9,1.0,698.8,NaN
2,Australia,2020,400333.466600,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN,TENNANT CRK POST OFFICE WAS 014050,1961-1970,...,14.3,NaN,11.8,NaN,40.6,NaN,-9999.9,1.0,321.3,NaN
3,Australia,2020,400333.466600,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN,LONGREACH POST OFFICE,1961-1973,...,19.6,NaN,22.3,NaN,84.1,NaN,-9999.9,1.0,433.7,NaN
4,Australia,2020,400333.466600,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN,ESSENDON AIRPORT AMO,1961-1972,...,51.5,NaN,42.7,NaN,57.5,NaN,-9999.9,1.0,594.9,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7768,Ukraine,1990,705830.043363,Electricity - total solar production,2020.0,"Kilowatt-hours, million",5969.400,NaN,DNEPROPETROVSK,1961-1990,...,32.0,NaN,42.0,NaN,52.0,NaN,513.0,NaN,513.0,NaN
7769,Ukraine,1990,705830.043363,Electricity - total solar production,2020.0,"Kilowatt-hours, million",5969.400,NaN,DONECK,1961-1990,...,27.0,NaN,42.0,NaN,52.0,NaN,515.0,NaN,515.0,NaN
7770,Ukraine,1990,705830.043363,Electricity - total solar production,2020.0,"Kilowatt-hours, million",5969.400,NaN,LUGANSK,1961-1990,...,27.0,NaN,42.0,NaN,43.0,NaN,473.0,NaN,473.0,NaN
7771,Ukraine,1990,705830.043363,Electricity - total solar production,2020.0,"Kilowatt-hours, million",5969.400,NaN,HAPOROZ'E,1961-1990,...,27.0,NaN,43.0,NaN,52.0,NaN,510.0,NaN,510.0,NaN
7772,Ukraine,1990,705830.043363,Electricity - total solar production,2020.0,"Kilowatt-hours, million",5969.400,NaN,KIRILLOVKA,1961-1990,...,26.0,NaN,48.0,NaN,62.0,NaN,584.0,NaN,584.0,NaN

In [187]:
DF = co2_solar_prep.copy()
DF.head()

,Country,Year_x,Value,Commodity - Transaction,Year_y,Unit_x,Quantity,Quantity Footnotes,Station Name,Period,...,Oct,Oct Footnotes,Nov,Nov Footnotes,Dec,Dec Footnotes,Annual,Annual Footnotes,Annual NCDC Computed Value,Annual NCDC Computed Value Footnotes
0,Australia,2020,400333.4666,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN,ALBANY (ALBANY TOWN),1961-1965,...,96.0,NaN,37.9,NaN,23.0,NaN,-9999.9,1.0,1012.3,NaN
1,Australia,2020,400333.4666,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN,ESPERANCE (ESPERANCE POST OFFICE),1961-1969,...,51.3,NaN,19.3,NaN,17.9,NaN,-9999.9,1.0,698.8,NaN
2,Australia,2020,400333.4666,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN,TENNANT CRK POST OFFICE WAS 014050,1961-1970,...,14.3,NaN,11.8,NaN,40.6,NaN,-9999.9,1.0,321.3,NaN
3,Australia,2020,400333.4666,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN,LONGREACH POST OFFICE,1961-1973,...,19.6,NaN,22.3,NaN,84.1,NaN,-9999.9,1.0,433.7,NaN
4,Australia,2020,400333.4666,Electricity - total solar production,2020.0,"Kilowatt-hours, million",21033.194,NaN,ESSENDON AIRPORT AMO,1961-1972,...,51.5,NaN,42.7,NaN,57.5,NaN,-9999.9,1.0,594.9,NaN

In [188]:
DF = DF[['Country','Year_x','Value','Quantity','Station Name','Annual NCDC Computed Value']]
DF

,Country,Year_x,Value,Quantity,Station Name,Annual NCDC Computed Value
0,Australia,2020,400333.466600,21033.194,ALBANY (ALBANY TOWN),1012.3
1,Australia,2020,400333.466600,21033.194,ESPERANCE (ESPERANCE POST OFFICE),698.8
2,Australia,2020,400333.466600,21033.194,TENNANT CRK POST OFFICE WAS 014050,321.3
3,Australia,2020,400333.466600,21033.194,LONGREACH POST OFFICE,433.7
4,Australia,2020,400333.466600,21033.194,ESSENDON AIRPORT AMO,594.9
...,...,...,...,...,...,...
7768,Ukraine,1990,705830.043363,5969.400,DNEPROPETROVSK,513.0
7769,Ukraine,1990,705830.043363,5969.400,DONECK,515.0
7770,Ukraine,1990,705830.043363,5969.400,LUGANSK,473.0
7771,Ukraine,1990,705830.043363,5969.400,HAPOROZ'E,510.0
7772,Ukraine,1990,705830.043363,5969.400,KIRILLOVKA,584.0

In [189]:
DF.rename(columns={'Value':'CO2_anual','Quantity':'solar_energy_anual','Annual NCDC Computed Value':'precipitation_anual','Year_x':'Year'}, inplace=True)

In [190]:
DF

,Country,Year,CO2_anual,solar_energy_anual,Station Name,precipitation_anual
0,Australia,2020,400333.466600,21033.194,ALBANY (ALBANY TOWN),1012.3
1,Australia,2020,400333.466600,21033.194,ESPERANCE (ESPERANCE POST OFFICE),698.8
2,Australia,2020,400333.466600,21033.194,TENNANT CRK POST OFFICE WAS 014050,321.3
3,Australia,2020,400333.466600,21033.194,LONGREACH POST OFFICE,433.7
4,Australia,2020,400333.466600,21033.194,ESSENDON AIRPORT AMO,594.9
...,...,...,...,...,...,...
7768,Ukraine,1990,705830.043363,5969.400,DNEPROPETROVSK,513.0
7769,Ukraine,1990,705830.043363,5969.400,DONECK,515.0
7770,Ukraine,1990,705830.043363,5969.400,LUGANSK,473.0
7771,Ukraine,1990,705830.043363,5969.400,HAPOROZ'E,510.0
7772,Ukraine,1990,705830.043363,5969.400,KIRILLOVKA,584.0

In [191]:
prep_mean = DF.groupby('Country')[['precipitation_anual']].agg('mean')
prep_mean

             precipitation_anual
Country
Australia             764.802985
Austria              1105.285714
Belarus               622.833333
Belgium               821.200000
Bulgaria              528.714286
Canada                -44.797984
Croatia               853.550000
Cyprus                320.000000
Denmark               727.277778
Estonia               612.333333
Finland               575.916667
France                736.062500
Germany               826.368421
Greece                624.800000
Hungary               560.571429
Ireland              1006.818182
Italy                 670.923000
Japan                1731.690323
Latvia                666.000000
Lithuania             682.214286
Luxembourg            875.600000
Malta                 553.300000
Netherlands           772.160000
New Zealand          1291.799094
Norway                860.461538
Poland                693.500000
Portugal              907.333333
Romania               583.454545
Slovakia              595.733333
Slovenia             1393.100000
Spain                 626.490000
Sweden                589.812500
Switzerland          1628.000000
Ukraine               568.000000

In [193]:
DF.drop(columns=['Station Name','precipitation_anual'],inplace=True)

In [194]:
DF = prep_mean.merge(DF,how='inner',left_on='Country',right_on='Country')
DF

        Country  precipitation_anual  Year      CO2_anual  solar_energy_anual
0     Australia           764.802985  2020  400333.466600           21033.194
1     Australia           764.802985  2020  400333.466600           21033.194
2     Australia           764.802985  2020  400333.466600           21033.194
3     Australia           764.802985  2020  400333.466600           21033.194
4     Australia           764.802985  2020  400333.466600           21033.194
...         ...                  ...   ...            ...                 ...
7768    Ukraine           568.000000  1990  705830.043363            5969.400
7769    Ukraine           568.000000  1990  705830.043363            5969.400
7770    Ukraine           568.000000  1990  705830.043363            5969.400
7771    Ukraine           568.000000  1990  705830.043363            5969.400
7772    Ukraine           568.000000  1990  705830.043363            5969.400

[7773 rows x 5 columns]

In [195]:
DF = DF.drop_duplicates()
DF

,Country,precipitation_anual,Year,CO2_anual,solar_energy_anual
0,Australia,764.802985,2020,400333.466600,21033.194
67,Australia,764.802985,2020,400333.466600,38.000
134,Australia,764.802985,2000,349635.486902,21033.194
201,Australia,764.802985,2000,349635.486902,38.000
268,Australia,764.802985,1990,278154.156296,21033.194
...,...,...,...,...,...
7624,Switzerland,1628.000000,1990,44159.881987,11.000
7628,Switzerland,1628.000000,1990,44159.881987,1.000
7632,Ukraine,568.000000,2020,206941.158967,5969.400
7679,Ukraine,568.000000,2000,285321.939446,5969.400
7726,Ukraine,568.000000,1990,705830.043363,5969.400

In [208]:
df_solar = DF.groupby(['Country','Year'])[['solar_energy_anual']].agg('sum')
df_solar.reset_index(inplace=True)
df_solar

         Country  Year  solar_energy_anual
0      Australia  1990           21071.194
1      Australia  2000           21071.194
2      Australia  2020           21071.194
3        Austria  1990            2045.934
4        Austria  2000            2045.934
..           ...   ...                 ...
97   Switzerland  2000            2610.659
98   Switzerland  2020            2610.659
99       Ukraine  1990            5969.400
100      Ukraine  2000            5969.400
101      Ukraine  2020            5969.400

[102 rows x 3 columns]

In [209]:
df_solar.drop_duplicates(subset='solar_energy_anual')

        Country  Year  solar_energy_anual
0     Australia  1990           21071.194
3       Austria  1990            2045.934
6       Belarus  1990             176.000
9       Belgium  1990            5105.400
12     Bulgaria  1990            1480.856
15       Canada  1990            4862.000
18      Croatia  1990              95.500
21       Cyprus  1990             295.608
24      Denmark  1990            1181.532
27      Estonia  1990             122.540
30      Finland  1990             220.471
33       France  1990           13403.392
36      Germany  1990           48701.000
39       Greece  1990            4446.854
42      Hungary  1990            2459.000
45      Ireland  1990              63.780
48        Italy  1990           24963.504
51        Japan  1990           79510.858
54       Latvia  1990               4.847
57    Lithuania  1990             128.800
60   Luxembourg  1990             161.261
63        Malta  1990             236.837
66  Netherlands  1990            8773.172
69  New Zealand  1990             160.216
72       Norway  1990              26.521
75       Poland  1990            1957.916
78     Portugal  1990            1716.590
81      Romania  1990            1733.375
84     Slovakia  1990             663.000
87     Slovenia  1990             368.196
90        Spain  1990           20690.000
93       Sweden  1990            1052.000
96  Switzerland  1990            2610.659
99      Ukraine  1990            5969.400

In [212]:
DF['solar_energy_anual']= df_solar['solar_energy_anual']

C:\Users\pieri\AppData\Local\Temp\ipykernel_11776\1690304481.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  DF['solar_energy_anual']= df_solar['solar_energy_anual']

In [ ]:
DF = prep_mean.merge(DF,how='inner',left_on='Country',right_on='Country')
DF